share/presentation/presentation.tex
% Created 2015-05-11 Mon 11:19
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\tolerance=1000
\usetheme{Antibes}
\usecolortheme{seagull}
\author{Sam Gwydir Chris Findeisen Martin Fracker Rafael Moreno Kyle Wilson}
\date{\textit{<2015-05-10 Sun>}}
\title{CSCE315 Final Project Presentation}
\hypersetup{
 pdfauthor={Sam Gwydir Chris Findeisen Martin Fracker Rafael Moreno Kyle Wilson},
 pdftitle={CSCE315 Final Project Presentation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3beta)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}


\section{DickGrayson}
\label{sec:orgheadline1}
\begin{ABSTRACT}
In the final project students were tasked with creating a collection of tools
that allow a user to encrypt and decrypt messages using the RSA encryption
algorithm and embed and extract messages (either plaintext or ciphertext) from
BMP images and WAV audio files.
\end{ABSTRACT}

\begin{frame}[fragile,label=sec-1-1]{DickGrayson}
 \begin{block}{Introduction}
\emph{DickGrayson} is a collection of tools that allow a user to encrypt and decrypt
messages using the RSA encryption algorithm and embed and extract messages
(either plaintext or ciphertext) from BMP images and WAV audio files.
\end{block}

\begin{block}{Tools}
\begin{description}
\item[{\texttt{munchkincrypt}}] (aka \texttt{rsa-crypt}) RSA Encryption
\item[{\texttt{dorothy}}] (aka \texttt{rsa-attack}) RSA Attacks
\item[{\texttt{munchkinsteg}}] (aka \texttt{stego-crypt}) Steganography
\item[{\texttt{toto}}] (aka \texttt{stego-attack}) Steganography Attacks
\end{description}
\end{block}
\end{frame}

\section{Design}
\label{sec:orgheadline1}
\begin{frame}[fragile,label=sec-2-1]{Design Decisions}
 \begin{block}{DickGrayson}
\begin{description}
\item[{Target OS}] Linux \texttt{x86\_64} (\texttt{build.tamu.edu})
\item[{Compiler}] \href{https://gcc.gnu.org/}{GCC 4.9.2}
\item[{Language}] C++14
\item[{Build System}] \href{https://cmake.org}{CMake}
\item[{Numerics}] \href{https://gmplib.org}{GNU Multiple Precision Library}
\item[{Unit Testing}] \href{https://code.google.com/p/googletest/}{Google Test}
\item[{Continuous Integration}] \href{http://travis-ci.org}{travis-ci}
\item[{Code Coverage}] \href{http://coveralls.io}{coveralls}
\end{description}
\end{block}
\end{frame}
\begin{frame}[label=sec-2-2]{Implementation Decisions}
\begin{block}{RSA Encryption}
\begin{itemize}
\item Especially, explain what attacks you chose to make for both RSA and stego, and
how your two stego schemes work
\item Show proofs of Test-Driven Development (screenshots of failing / passing
tests, GitHub revision history, running test code in the demo, etc)
\end{itemize}
\end{block}
\begin{block}{RSA Attacks}
\begin{itemize}
\item Attacked using one general purpose attack, which would work on any rsa key, 
then created two more specific attacks that are efficient in some cases.
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-2-3]{Implementation Decisions (cont.)}
\begin{block}{Steganography}
\begin{itemize}
\item Use null byte to signify end of message
\item Use a unified tool for both wav and bmp steganography
\end{itemize}
\end{block}
\begin{block}{Steganography Attacks}
\begin{itemize}
\item Attack using md5 and extract from Munchkinsteg BMP and WAV
\item Attack using LSB scramble for BMP and WAV
\end{itemize}
\end{block}
\end{frame}
\section{Demonstration}
\label{sec:orgheadline1}
\begin{frame}[label=sec-3-1]{Build System \& Tools}
\begin{itemize}
\item Travis
\item Coveralls
\end{itemize}
\end{frame}
\begin{frame}[fragile,label=sec-3-2]{\texttt{rsa-crypt}}
 \begin{itemize}
\item generate primes
\item generate public and private keys
\item encrypt and decrypt example messages
\end{itemize}
\end{frame}
\begin{frame}[fragile,label=sec-3-3]{\texttt{rsa-attack}}
 \begin{block}{factorization}
Trial division method brute forces factorization only trying primes. 
Will break any RSA key no matter how big!*
*given enough time
\end{block}
\begin{block}{common modulus}
Common modulus takes advantage of a shared n between two separate key/crypttext. 
Through some clever exponenetiation, we can obtain the original message.
\end{block}
\begin{block}{low exponent}
Low exponent attack works wherever you have e identical messages with different parties. 
Clearly, this is most effective and practical when e = 3.
\end{block}
\end{frame}
\begin{frame}[fragile,label=sec-3-4]{\texttt{stego-crypt}}
 \begin{block}{How it works}
Our tool munchkinsteg supports image and audio least significant bit (LSB)
steganography. The formats supported are Windows 8-bit BMP and PCM 16-bit WAV.
\end{block}
\begin{block}{Embedding message}
The data is broken up into bits and each bit is stored consecutively in the LSB
of the individual pixels and samples of the bmp and wav file respectively. A
null byte is stored using 8 additional pixels/samples to be used during
extraction as a termination symbol.
\end{block}
\end{frame}
\begin{frame}[fragile,label=sec-3-5]{\texttt{stego-crypt} (cont.)}
 \begin{block}{Extracting message}
The LSB of the individual pixels and samples of the bmp and wav file
respectively are extracted and concatenated into a string. This process
terminates once a null byte is reached.
\end{block}
\end{frame}

\section{Conclusion}
\label{sec:orgheadline1}
\begin{frame}[label=sec-4-1]{Conclusion}
We've shown RSA and Stegonography, and we've demonstrated attacks on both. We learned 
the difficulties and fun of encryption, and how exploits often rely on corner cases because 
general purpose exploits are typically slow.
\end{frame}
\begin{frame}[label=sec-4-2]{Discussion}
\begin{block}{Problems}
We had some difficulties using GMP and other helper libraries. As always, research was
crucial in our success. 
\end{block}

\begin{block}{Future work}
In the future, we'd like to make our solutions more robust--full base 64
encoding/decoding, writing to .pem/.priv formats, etc.
\end{block}
\end{frame}
\section{References}
\label{sec:orgheadline1}
\begin{frame}[label=sec-5-1]{Links}
\begin{description}
\item[{GCC 4.9.2}] \url{https://gcc.gnu.org}
\item[{GNU Multiple Precision Library}] \url{https://gmplib.org}
\item[{Google Test}] \url{https://code.google.com/p/googletest/}
\item[{travis-ci}] \url{https://travis-ci.org}
\item[{coveralls}] \url{https://coveralls.io}
\end{description}
\end{frame}
\end{document}